In [1]:
# 0. scientist.csv
# 1. df로 읽어들이고
# 2. df의 전체 데이터셋 타입을 확인
# 3. df의 컬럼리스트를 확인
# 4. df의 값을 확인
# 5. df의 맨 마지막에 price항목을 추가(값은 임의대로 넣음. int)
# 6. df의 맨 마지막에 percent항목을 추가(값의 임의대로 넣음. float)
# 7. df의 맨 마지막에 sale항목을 추가(price * percent)
# 8. df의 Name컬럼 추출
# 9. df의 인덱스 확인
# 10. df의 Name컬럼의 값이 Rosaline인 행 추출
# 11. df의 Name컬럼 중 3~5사이의 행 추출
# 12. df의 Name, Died컬럼 모든 행 추출
# 13. df의 Born컬럼부터 끝컬럼까지 모든 행 추출
# 14. df의 Born, Age컬럼의 5~7행 추출
# 15. df.shape을 통해 몇행 몇열인지 확인해보세요.
# 16. df의 숫자 데이터의 상세정보 확인
# 17. Nurse라는 스트링 추출(index와 컬럼명을 사용)
# 18. Alan Turing이라는 스트링 추출(index와 컬럼명을 사용)
# 19. Biologist를 Scientist로 변경
# 20. df의 변경된 내용은 수시로 프린트해볼 것.

In [ ]:
# info() : 항목별 갯수와 datatype

In [ ]:
# head(5), tail(5) : 일부분

In [ ]:
# describe(include='object')

In [ ]:
# df[항목명].value_counts() : 항목의 개수, 타입

In [ ]:
# df.T : 행, 열 전환

In [ ]:
# df[항목명].astype('int32') : 항목의 타입 변환(float32, str, category)

In [ ]:
# df.sort_index(), df.sort_index(ascending=False) : index로 정렬

In [ ]:
# df.sort_values(by='age') : age컬럼으로 오름차순 정렬

In [ ]:
# df.sort_values(by='age', ascending=False)

In [ ]:
# df.sort_values(by=['fare', 'age'])

In [2]:
# df.sort_values(by=['fare', 'age'], ascending=[False, True])

In [3]:
# condition = df['who'] == 'man'
# df[condition], df.loc[condition]
# df[condition]['age']
# df[condition]['age'] = 2 (허용x)
# df.loc[condition, 'age'] = 2 (허용o)

In [ ]:
# 조건1 정의
# condition1 = (df['fare'] > 30)

# 조건2 정의
# condition2 = (df['who'] == 'woman')

In [ ]:
# df.loc[condition1 & condition2]

In [ ]:
# df.loc[condition1 | condition2]

In [4]:
import seaborn as sns

In [5]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# 나이가 30살 이상 남자 승객 조건 필터링
# fare를 많이 낸 순서로 내림차순 정렬
# 상위 10개를 출력

In [ ]:
# 나이가 20살 이상 40살 미만인 승객
# pclass가 1등급 혹은 2등급인 승객
# 열(column)은 survived, pclass, age, fare 만 나오게 출력
# 10개만 출력

In [ ]:
# sample['name'].isin(['kim', 'lee'])

In [ ]:
# sample.isin(['kim', 'lee'])
# condition = sample['name'].isin(['kim', 'lee'])
# sample.loc[condition]

In [ ]:
# df1['VIP'] = True

In [ ]:
# df1.drop(1) : 행삭제

In [ ]:
# df1.drop(df1.index[0:10])

In [ ]:
# df1.drop(df1.index[[1, 3, 5, 7, 9]])

In [ ]:
# df1.drop('class', axis=1) ==> df1.drop('class', 1)

In [ ]:
# df1.drop(['who', 'deck', 'alive'], axis=1)
# df1.drop(['who', 'deck', 'alive'], axis=1, inplace=True)

In [ ]:
# df1 = df.copy()

In [ ]:
# df1['round'] = round(df1['fare'] / df1['age'], 2)